rottenpotatoes/app/controllers/movies_controller.rb

  def director
    if params.has_key? :title
      #debugger
      unless Movie.find_by_title(params[:title]).director.nil?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT 1  [["title", "title"]]